[
  {
    "role": "Senior Technician",
    "employee_id": "EMP-0142",
    "creation_date": { "$date": "2025-05-03T10:17:00Z" },
    "type": "maintenance",
    "text": "When you get a high temperature alert on M1, nine times out of ten it’s due to tool wear, especially if it hasn’t been replaced in the last month. Even if the coolant looks fine, a dull tool can generate a lot of heat. It's not always logged properly in the system, so the best bet is to inspect the tool first before doing anything drastic."
  },
  {
    "role": "Junior Maintenance Engineer",
    "employee_id": "EMP-0267",
    "creation_date": { "$date": "2025-04-21T14:38:00Z" },
    "type": "maintenance",
    "text": "We’ve had a few false positives on the vibration sensor for M1 — sometimes during startup or right after lubrication. But persistent vibration issues usually point to a mounting bracket coming loose or a misaligned bearing. Once we found the root cause was a slightly warped impeller that wasn’t caught during inspection."
  },
  {
    "role": "Maintenance Planner",
    "employee_id": "EMP-0183",
    "creation_date": { "$date": "2025-04-10T09:50:00Z" },
    "type": "maintenance",
    "text": "There was a period last quarter when we got repeated high-temp alerts on M1. We traced it back to an intermittent coolant blockage that wouldn’t show up during routine checks. The flexible tubing was kinking under pressure at high RPMs. We had to add a bracket to keep it stable."
  },
  {
    "role": "Reliability Engineer",
    "employee_id": "EMP-0309",
    "creation_date": { "$date": "2025-03-28T16:12:00Z" },
    "type": "maintenance",
    "text": "One of the challenges with the vibration alerts is that M1 operates near its threshold when running high-load cycles. Normal operation at full capacity brings vibration close to 1.6 mm/s. So context matters — an alert might be real or just a borderline case. We really need to look at the full time-series data to confirm."
  },
  {
    "role": "Technician Trainer",
    "employee_id": "EMP-0119",
    "creation_date": { "$date": "2025-05-12T08:25:00Z" },
    "type": "maintenance",
    "text": "We trained the new hires to always check the impeller condition manually if they see E13. It’s not enough to rely on sensors — visual inspection has caught small cracks or buildup that caused minor imbalances. It's subtle, but enough to trigger an alert."
  }
]
